<!-- dflook/terraform-github-actions {"workspace":"default","backend":"4bef3a77dfc04abc6de40df069f85639da970aa6cf4994956328985c47889c50","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #255 at https://github.com/dflook/terraform-github-actions/actions/runs/3253215683","plan_hash":"0853b549fadec56d89ee13dcfbc7159f3a3841dcfbb9ebaa42d9c8ecc56b53d9","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "zOCQ3bAFYL" -> (known after apply)
  ~ foreach = "yTLZAxIVL1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #255](https://github.com/dflook/terraform-github-actions/actions/runs/3253215683)